Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཟང་ཟིང་གི་སྦྱིན་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པས་སྡུད་པ་ཡིན་ཏེ།
en: It is in this manner, Subhūti, that bodhisattva great beings attract beings with material gifts and the gift of the Dharma.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ངོ་མཚར་དང་། རྨད་དུ་བྱུང་བའི་ཆོས་སོ།
en: This, Subhūti, is indeed a wonderful and marvelous doctrine of bodhisattva great beings. “

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚིག་སྙན་པས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཏེ། འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Subhūti, if you ask how bodhisattva great beings attract beings with their pleasant speech, in this regard, Subhūti, bodhisattva great beings attract beings through the six perfections.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙན་པར་སྨྲ་བས་སེམས་ཅན་རྣམས་སྡུད་དོ།
en: Thus, it is by means of the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom—all these six perfections—that bodhisattva great beings attract beings through their pleasant speech.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་དགེ་བའི་ཆོས་ཐམས་ཅད་མ་འདུས་པ་མེད་དེ།
en: If you ask why, it is because there are no virtuous attributes that are not subsumed in these six perfections.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚིག་སྙན་པར་སྨྲ་བས་སེམས་ཅན་རྣམས་སྡུད་དོ།
en: It is in this manner, Subhūti, that bodhisattva great beings attract beings through their pleasant speech. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་བྱ་བས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་དོན་བྱ་བས་སེམས་ཅན་རྣམས་སྡུད་དོ།
en: Subhūti, if you ask how bodhisattva great beings attract beings through their purposeful activity, in this regard, Subhūti, bodhisattva great beings attract beings through their purposeful activity by means of these six perfections.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་དགེ་བའི་ཆོས་ཐམས་ཅད་མ་འདུས་པ་མེད་དེ།
en: If you ask why, it is because there are no virtuous attributes that are not subsumed in these six perfections.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་བྱ་བས་སེམས་ཅན་རྣམས་སྡུད་དོ།
en: It is in this manner, Subhūti, that bodhisattva great beings attract beings through their purposeful activity. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་འཐུན་པས་སེམས་ཅན་རྣམས་སྡུད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གི་དོན་འཐུན་པས་སེམས་ཅན་རྣམས་སྡུད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Subhūti, if you ask how bodhisattva great beings attract beings through their harmony, in this regard, Subhūti, bodhisattva great beings attract beings through their harmony by means of these six perfections.

source: དེ་ནི་འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་གིས་དགེ་བའི་ཆོས་ཐམས་ཅད་མ་འདུས་པ་མེད་དེ།
en: If you ask why, it is because there are no virtuous attributes that are not subsumed in these six perfections.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དོན་འཐུན་པས་སེམས་ཅན་རྣམས་སྡུད་དོ།
en: It is in this manner, Subhūti, that bodhisattva great beings attract beings through their harmony.

source: །རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བའི་ཆོས་སོ།
en: This too, Subhūti, is a wonderful and marvelous doctrine of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་དག་ལ་འདི་སྐད་འདོམས་ཤིང་འདི་སྐད་སྟོན་ཏོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཚུར་ཤེག །
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they instruct other bodhisattva great beings and teach them the Dharma, saying, ‘Come here, noble children!

source: ཡི་གེ་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པར་གྱིས་ཤིག །
en: May you become skilled in the formation of syllables!

source: ཡི་གེ་གཅིག་ལ་མཁས་པར་གྱིས་ཤིག །
en: That is to say, may you become skilled in the formation of a single syllable!

source: ཡི་གེ་གཉིས་ནས་ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བར་ལ་མཁས་པར་གྱིས་ཤིག །
en: May you become skilled in the formation of anything from two syllables up to the forty-two syllables!

source: ཡི་གེ་གཅིག་གིས་བྱང་བའི་རང་བཞིན་ཐམས་ཅད་ཤེས་པར་གྱིས་ཤིག །
en: May you realize all the natural expressions [of speech] that are refined through a single syllable.

source: ཡི་གེ་གཉིས་ཀྱིས་བྱང་བའི་རང་བཞིན་ཐམས་ཅད་ཤེས་པར་གྱིས་ཤིག །
en: May you realize all the natural expressions [of speech] that are refined through two syllables. {Ki.

source: ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བར་གྱིས་བྱང་བའི་རང་བཞིན་ཐམས་ཅད་ཤེས་པར་གྱིས་ཤིག །
en: VIII: 68} May you realize all the natural expressions [of speech] that are refined through anything up to forty-two syllables!

source: ཡི་གེ་གཅིག་ཏུ་ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་འདུས་པར་སྒོམས་ཤིག །
en: May you cultivate the gathering of anything up to and including forty-two syllables in a single syllable!

source: ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་སུ་ཡི་གེ་གཅིག་འདུས་པར་སྒོམས་ཤིག །ཅེས་ཆོས་སྟོན་ཏོ།
en: May you cultivate the gathering of a single syllable in the forty-two syllables!’ “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཡང་ཡི་གེ་གཅིག་ལ་མཁས་པ་ཡིན། ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བར་ལ་མཁས་པ་ཡིན། ཡི་གེ་གཅིག་གི་ནང་དུ་ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་འདུས་པར་བསྒོམ་པ་ལ་མཁས་པ་ཡིན། ཡི་གེ་བཞི་བཅུ་རྩ་གཉིས་སུ་ཡི་གེ་གཅིག་འདུས་པར་བསྒོམ་པ་ལ་མཁས་པ་ཡིན་ཏེ།
en: Subhūti, those bodhisattva great beings should be skilled in cultivating the gathering of the forty-two syllables in a single syllable, and they should be skilled in cultivating the gathering of a single syllable within the forty-two syllables.

source: དེ་དེ་ལྟར་ཡི་གེ་མངོན་པར་བསྒྲུབ་པ་མཁས་པར་བྱ་བ་ལ་གོམས་ཤིང་ཡི་གེ་མེད་པ་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: When in that manner they have mastered the formation of syllables, they should then become skilled in the formation of [speech] that is without syllables.

source: དཔེར་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ལ་མཁས་པ་དང་། ཡི་གེ་ལ་མཁས་པ་ཡིན་ཏེ། ཆོས་ལ་མཁས་པ་དང་། ཡི་གེ་ལ་མཁས་པས།
en: For example, Subhūti, the tathāgatas, arhats, completely awakened buddhas are skilled in the Dharma and skilled in syllables, and since they are skilled in the Dharma and skilled in syllables, they teach through multiple syllables the Dharma that is without syllables.

source: ཡི་གེ་མང་པོས་ཡི་གེ་མེད་པའི་ཆོས་སྟོན་ཀྱང་། རབ་འབྱོར་ཆོས་དེ་ཡི་གེའི་རྣམ་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་ཏེ།
en: And yet, Subhūti, that Dharma is not quite divorced from the form of the syllables.

source: རབ་འབྱོར་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བའི་ཆོས་ཏེ། གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཉེ་བར་བཟུང་སྟེ། སེམས་ཅན་ཡང་ཤིན་དུ་མི་དམིགས། ཆོས་ཀྱང་མི་དམིགས།
en: This too, Subhūti, is a wonderful and marvelous doctrine of bodhisattva great beings, which is not shared in common with any of the śrāvakas or pratyekabuddhas.”

source: ཆོས་ཀྱི་དངོས་པོ་ཡང་མི་དམིགས་པ་ལགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if, owing to the emptiness of the unlimited and the emptiness of that which has neither beginning nor end, beings, too, are absolutely nonapprehensible, nor indeed is the Dharma apprehensible, and nor indeed is the entity of the Dharma apprehensible, then, Blessed Lord, how do bodhisattva great beings practice the perfection of wisdom, the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity?

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་སྤྱོད་པ་དང་།
en: How do they practice the four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions?

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་ལ་སྤྱོད་པ་དང་།
en: How do they practice the thirty-seven factors conducive to enlightenment?

source: སྟོང་པ་ཉིད་བཅུ་བཞི་ལ་སྤྱོད་པ་དང་།
en: How do they practice the fourteen aspects of emptiness?

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྤྱོད་པ་དང་།
en: How do they practice the meditative stabilities of emptiness, signlessness, and wishlessness?

source: རྣམ་པར་ཐར་པ་བརྒྱད་ལ་སྤྱོད་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: How do they practice the eight aspects of liberation?

source: མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལ་སྤྱོད་ཅིང་། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་དྲུག་ལ་གནས་ནས། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པར་འགྱུར།
en: How do they then maintain the six extrasensory powers that originate from the ripening [of past actions] and teach the Dharma to beings? “

source: དེ་ལ་ནི་སེམས་ཅན་མི་དམིགས་ཏེ། སེམས་ཅན་དུ་གདགས་པ་ཡང་མི་དམིགས་སོ།
en: In this regard, beings are not apprehended, nor is the concept ‘being’ even apprehended.

source: །སེམས་ཅན་མི་དམིགས་པས། གཟུགས་དམིགས་སུ་མ་མཆིས་སོ།
en: Since beings are not apprehended, physical forms are not apprehensible.

source: །སེམས་ཅན་མི་དམིགས་པས་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དམིགས་སུ་མ་མཆིས་སོ།
en: Since beings are not apprehended, feelings, perceptions, formative predispositions, and consciousness are not apprehensible.

source: །སེམས་ཅན་མི་དམིགས་པས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་དམིགས་སུ་མ་མཆིས་སོ།
en: Since beings are not apprehended, [the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are not apprehensible.

source: །སེམས་ཅན་མི་དམིགས་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དམིགས་སུ་མ་མཆིས་སོ།
en: Since beings are not apprehended, [the goals], up to and including all-aspect omniscience, are not apprehensible.

source: །སེམས་ཅན་མི་དམིགས་པས། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དམིགས་སུ་མ་མཆིས་སོ། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དམིགས་སུ་མ་མཆིས་སོ།
en: Since beings are not apprehended, the thirty-two major marks of a great person are not apprehensible, and the eighty excellent minor marks are not apprehensible.

source: །སེམས་ཅན་དམིགས་སུ་མ་མཆིས་པ་ལ་ནི་སེམས་ཅན་མ་མཆིས་སོ།
en: Since beings are not apprehensible, beings are not discerned.

source: །གཟུགས་མ་མཆིས་སོ།
en: Physical forms are not discerned.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་མཆིས་སོ།
en: Feelings, perceptions, formative predispositions, and consciousness are not discerned. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་མ་མཆིས་སོ།
en: The causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are not discerned. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་མཆིས་སོ།
en: The goals], up to and including all-aspect omniscience, are not discerned.

source: །མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་མ་མཆིས་སོ། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་མ་མཆིས་སོ།
en: The thirty-two major marks of a great person are not discerned, and the eighty excellent minor marks are not discerned. {Ki.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་མི་དམིགས་ན། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་དམིགས་པར་འགྱུར་བ་ལྟ་ག་ལ་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: VIII: 69} If one were to ask why, Blessed Lord, it is because when bodhisattva great beings practice the perfection of wisdom in that manner, if even the nature of a bodhisattva is not apprehended, how could the factors conducive to enlightenment possibly be apprehended!” “

source: རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: Subhūti, it is so!

source: །རབ་འབྱོར་དེ་ལྟར་སེམས་ཅན་མི་དམིགས་པས་ནང་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །ཕྱི་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །ཕྱི་ནང་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རིག་པར་བྱའོ། །ཕུང་པོ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །ཁམས་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: Subhūti, it is because beings are not apprehended that the emptiness of internal phenomena should be known, the emptiness of external phenomena should be known, the emptiness of both external and internal phenomena should be known, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, should be known. [

source: །སྐྱེ་མཆེད་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །བདེན་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །བདག་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །སེམས་ཅན་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །སྲོག་དང་འགྲོ་བ་དང་གསོ་བ་དང་སྐྱེས་བུ་དང་། གང་ཟག་དང་ཤེད་ཅན་དང་ཤེད་བདག་དང་བྱེད་པ་པོ་དང་བྱེད་དུ་འཇུག་པ་པོ་དང་། སློང་བ་པོ་དང་ཀུན་ནས་སློང་བ་པོ་དང་། ཚོར་བ་པོ་དང་ཚོར་བར་བྱེད་པ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: It is because beings are not apprehended that] the emptiness of the psycho-physical aggregates should be known, the emptiness of the sensory elements should be known, the emptiness of the sense fields should be known, the emptiness of the links of dependent origination should be known, the emptiness of the [noble] truths should be known, the emptiness of the self should be known, the emptiness of beings should be known, and the emptiness of life forms, living beings, life, living creatures, individual personalities, human beings, persons, actors, agents, petitioners, instigators, experiencers, instigators of experience, knowers, and viewers should be known. [

source: །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: It is because beings are not apprehended that] the emptiness of the applications of mindfulness should be known, and that the emptiness of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path should be known. [

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: It is because beings are not apprehended that] the emptiness of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas should be known. [

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: It is because beings are not apprehended that] the emptiness of the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment should be known. [

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: It is because beings are not apprehended that] the emptiness of knowledge of the path and all-aspect omniscience should be known. [

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །སངས་རྒྱས་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: It is because beings are not apprehended that] the emptiness of the buddhafields should be known, the emptiness of the buddhas should be known, and the emptiness of the bodhisattvas should be known. “

source: །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་དེ་དག་ཐམས་ཅད་སྟོང་པར་མཐོང་ནས། ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: In this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, having seen all phenomena as emptiness, they teach the Dharma to beings who have resorted to erroneous views.

source: ཇི་ལྟར་སྟོང་པ་ཉིད་དེ་དག་ལ་ཡང་མི་འཇུག་པ་དེ་ལྟར་སྟོན་ཏོ།
en: Just as they do not at all engage with those aspects of emptiness, they teach [the Dharma] accordingly.

source: །དེས་དེ་ལྟར་མཐོང་ནས་ཆོས་ཐམས་ཅད་སྒྲིབ་པ་མེད་པར་ཤེས་ཏེ། ཆོས་གང་ཡང་འཁྲུག་པར་མི་བྱེད། གཉིས་སུ་མི་བྱེད་དོ། །ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་སྟོན་པར་བྱེད་དོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ནི།
en: Perceiving in this way, they know all phenomena to be without obscuration, and then, without disturbing anything at all and without dualizing, they indeed teach [this Dharma], exactly as it is.

source: སྤྲུལ་པ་བྱེ་བ་ཕྲག་དུ་མ་སྤྲུལ་ཅིང་སེམས་ཅན་ལ་ལ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱོར། ལ་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ལ་ལ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ལ་ལ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ལ་ལ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱོར། ལ་ལ་བསམ་གཏན་བཞི་དང་། ལ་ལ་ཚད་མེད་པ་བཞི་དང་། ལ་ལ་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་སྦྱོར། ལ་ལ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྦྱོར། ལ་ལ་འཕགས་པའི་བདེན་པ་བཞི་དང་། ལ་ལ་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། ལ་ལ་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། ལ་ལ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། ལ་ལ་མངོན་པར་ཤེས་པ་ལྔ་ལ་སྦྱོར། ལ་ལ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། ལ་ལ་གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་སྦྱོར། ལ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། ལ་ལ་མི་འཇིགས་པ་བཞི་དང་།
en: Subhūti, just as when an emanation of the tathāgatas projects many tens of millions of phantoms, some of whom engage in the perfection of generosity toward beings, and some engage in the perfection of ethical discipline, some in the perfection of tolerance, some in the perfection of perseverance, some in the perfection of meditative concentration, and some in the perfection of wisdom; while some engage in the four meditative concentrations, some in the four immeasurable attitudes, some in the four formless absorptions, some in the thirty-seven factors conducive to enlightenment, some in the four truths of the noble ones, some in the eight aspects of liberation, some in the nine serial steps of meditative absorption, some in emptiness, signlessness, {Ki.

source: ལ་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། ལ་ལ་བྱམས་པ་ཆེན་པོ་དང་། ལ་ལ་སྙིང་རྗེ་ཆེན་པོ་དང་། ལ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྦྱོར། ལ་ལ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སྦྱོར། ལ་ལ་ལན་ཅི
en: VIII: 70} and wishlessness, and some in the five extrasensory powers; while some engage in all the meditative stabilities and some in all the dhāraṇī gateways, some in the ten powers of the tathāgatas, some in the four fearlessnesses, some in the four kinds of exact knowledge, some in great loving kindness, some in great compassion, and some in the eighteen distinct qualities of the buddhas; and while some engage in the fruit of entering the stream to nirvāṇa, some engage in the fruit of being destined for only one more rebirth [within cyclic existence], some in the fruit of not being reborn [within cyclic existence], some in arhatship, some in individual enlightenment, and some in [the other goals], up to and including all-aspect omniscience, do you think, Subhūti, that that emanation would have differentiated anything at all?” “

source: ག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ལ་ལ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། ལ་ལ་དགྲ་བཅོམ་པ་ཉིད་དང་། ལ་ལ་རང་བྱང་ཆུབ་ལ་སྦྱོར། ལ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྦྱོར་ན། རབ་འབྱོར་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྤྲུལ་པ་དེས་ཆོས་ལ་ལ་ཞིག་ཐ་དད་དུ་ཕྱེ་བ་ཡོད་དམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Blessed Lord!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། དེ་དག་ཕྱིན་ཅི་ལོག་རྣམས་ལས་ཡོངས་སུ་བཀྲོལ་ནས། མ་བཅིངས་མ་གྲོལ་བའི་ཚུལ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་འགོད་དོ།
en: Similarly, Subhūti,” continued the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they teach the Dharma to beings, and after releasing them from erroneous views, they establish them definitively [on the bodhisattva levels] in a manner that is neither bound nor liberated.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་མ་བཅིངས་མ་གྲོལ་བ།
en: If you ask why, Subhūti, it is because physical forms are neither bound nor liberated.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མ་བཅིངས་མ་གྲོལ་བ།
en: Feelings, perceptions, formative predispositions, and consciousness are neither bound nor liberated. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་བཅིངས་མ་གྲོལ་བ་སྟེ།
en: The attributes and goals], up to and including all-aspect omniscience, are neither bound nor liberated.

source: གཟུགས་ཀྱི་མ་བཅིངས་མ་གྲོལ་བ་ཉིད་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ནོ།
en: Nor does the nonbondage and nonliberation of physical forms constitute physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མ་བཅིངས་མ་གྲོལ་བ་ཉིད་གང་ཡིན་པ་དེ་རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ།
en: The nonbondage and nonliberation of feelings, perceptions, formative predispositions, and consciousness do not constitute consciousness [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་མ་བཅིངས་མ་གྲོལ་བ་ཉིད་གང་ཡིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ།
en: The nonbondage and nonliberation of [the attributes and goals], up to and including all-aspect omniscience, do not constitute all-aspect omniscience [and so forth].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུགས་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ།
en: If you ask why, it is because physical forms are absolutely pure.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ།
en: Feelings, perceptions, formative predispositions, and consciousness are absolutely pure. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་ཤིན་དུ་རྣམ་པར་དག་པའོ།
en: The attributes and goals], up to and including all-aspect omniscience, are absolutely pure. “

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཀྱང་སེམས་ཅན་དུ་མི་དམིགས་སོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they do teach the Dharma to beings, but they do not apprehend beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་ཐམས་ཅད་མི་དམིགས་པ་ལ། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་ཏེ།
en: Bodhisattva great beings do not apprehend anything, and they dwell without apprehending anything.

source: གཟུགས་སྟོང་པ་ཉིད་མི་གནས་པའི་ཚུལ་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་མི་གནས་པའི་ཚུལ་དང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་པ་ཉིད་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་ཏེ།
en: They dwell in a nondwelling manner with respect to the emptiness of physical forms; in a nondwelling manner with respect to the emptiness of feelings, perceptions, formative predispositions, and consciousness; and without apprehending anything at all with respect to the emptiness of [the attributes and goals], up to and including all-aspect omniscience.
